#lang racket
;Задача 1. Да се напише функция mymin, която приема два аргумента и връща по-малкия от тях.

(define (mymin a b)
  (if (< a b)
      a
      b))

;Задача 2. Да се дефинира функцията inside? x a b, която проверява дали числото x се намира в затворения интервал [a, b].

(define (inside? x a b)
  (and
   (<= x b)
   (<= a x)))

;Задача 3. Да се напише функция myfunc, която пресмята на средно аритметичното от квадратите на 2 числа.

(define (sqr x) (* x x))

(define (myfunc a b)
  (/ (+ (sqr a) (sqr b)) 2))
   

;Задача 4. Да се напише myfib, която получава един аргумент n и връща n-тото число на Фибоначи.

(define (myfib n)
  (if (<= n 1)
      1
      (+ (myfib(- n 1)) (myfib(- n 2)))))

;Да се напише и итеративно решение.(Заб.: редицата е 1, 1, 2, 3, 5, ... и е индексирана от 0.)


;Задача 5. Да се напише функция mygcd a b, която връща НОД(a, b).